{
  "sectionTitle": "Рекомендації",
  "viewRefs": "Перейти до рекомендацій",
  "readFull": "Читати повністю",
  "references": [
    {
    "id": 1,
    "name": "Nataliya Klymenko",
    "position": "Product Director at Nabooki", 
    "snippet": "\"I had the pleasure to work with Yuliia Kruta during her tenure as a Junior Developer / Trainee at Nabooki from May to August 2022. During this period, Yuliia consistently demonstrated a strong work ethic and quickly became a dependable and engaged member of our team.\"<br/><br/>\"One of Yuliia’s standout qualities was her eagerness to learn. She consistently approached tasks with diligence and thoughtfulness, showing an admirable ability to pick up new skills quickly.\"",
    "link": "https://drive.google.com/file/d/1LFVozQRb7ftBf0HHoy2OLtQ1cjiVB5Xz/view?usp=sharing"
  },
  {
    "id": 2,
    "name": "Kylee Taylor",
    "position": "Executive Housekeeper at Landmark Resort and Spa",
    "snippet": "\"I have found her to be extremely reliable, very efficient, and hardworking. Yuliia demonstrates professionalism, integrity, enthusiasm, initiative and maturity every shift.\"<br/><br/> \"Yuliia would be a fantastic asset for any organisation that she wishes to pursue in the future. I couldn’t recommend Yuliia highly enough and would absolutely rehire her.\"",
    "link": "https://drive.google.com/file/d/1kbT0Pfb-ZEC2zyeFGtAZ3JuV6Y5CVyJL/view?usp=sharing"
  },
  {
    "id": 3,
    "name": "Dr Toby Gifford",
    "position": "Lecturer in Design at UniSC",
    "snippet": "\"From the first class it was apparent that Yuliia was a top student, as she found some errors in the codebase I had provided to the class as a template. Not only did she find errors, but she provided solutions, which I have incorporated into these templates ever since.\"<br/><br/>\"In implementation she naturally took on the technical heavy lifting, and was adept at working constructively with design students to bring their ideas to fruition.\"",
    "link": "https://drive.google.com/file/d/10HAJOmbTEG6bDxpFZmrGg-Si_RSuDHmq/view?usp=sharing"
  },
  {
    "id": 4,
    "name": "Andrew Lang",
    "position": "Lecturer at UniSC",
    "snippet": "\"I was fortunate to teach Yuliia Kruta during her studies at UniSC. <br/><br/>Yuliia was always well read and up to date with the material and research to help form her opinions. She was a leader in the discussions in class and often brought new ideas to the workshop.\"",
    "link": "https://drive.google.com/file/d/1phs_KRWmurULOz0LrF1Pqv0qbw7wtVHP/view?usp=sharing"
  },
  {
    "id": 5,
    "name": "Oscar Imaz-Mairal",
    "position": "Lecturer at UniSC",
    "snippet": "\"One of her standout qualities was her ability to present complex ICT content in an engaging and accessible manner. Whether communicating in group discussions or delivering formal presentations, Yuliia consistently captured the attention of peers and conveyed ideas with clarity, confidence, and creativity..\"",
    "link": "https://drive.google.com/file/d/1q7hInb8oPCN6DSyJ7_0UU_0_3KnL8sqP/view?usp=sharing"
  }
]
}