{
  "sectionTitle": "Моя Історія",
  "timeline": [
    {
      "title": "Закінчила школу",
      "location": "Київ, Україна",
      "description": "Закінчила школу будучи <span style='color:#ff002e'>першою</span> в рейтингу на паралелі.",
      "date": "2020",
      "icon": "school"
    },
    {
      "title": "Склала ЗНО",
      "location": "Київ, Україна",
      "description": "Склала ЗНО з високими балами: <span style='color:#ff002e'>195/200</span> з математики та <span style='color:#ff002e'>190/200</span> з англійської мови.",
      "date": "2020",
      "icon": "study"
    },
    {
      "title": "Бакалавр Комп’ютерних наук",
      "location": "Національний університет «Києво-Могилянська академія»",
      "description": "Вступила до одного з <span style='color:#ff002e'>найпрестижніших і найстаріших університетів</span> України. Вивчала комп’ютерні науки з акцентом на алгоритми та структури даних, програмування, бази даних та інші ключові напрями.",
      "date": "2020–2022",
      "icon": "university"
    },
    {
      "title": "Репетитор з математики та ІТ",
      "location": "Україна",
      "description": "Працювала репетитором з математики та ІТ для дітей віком від 7 до 16 років. <span style='color:#ff002e'>Розробляла індивідуальні програми навчання</span>, що відповідали шкільній програмі, допомагаючи учням долати труднощі в навчанні та досягати бажаних результатів. <span style='color:#ff002e'>Менторила старшого учня</span> (17 років), який успішно склав випускні іспити й вступив до омріяного університету.",
      "date": "2020–2022",
      "icon": "tutor"
    },
    {
      "title": "Переїзд до Австралії через війну в Україні",
      "location": "Австралія",
      "description": "Взяла академвідпустку в українському університеті та переїхала на <span style='color:#ff002e'>Саншайн-Кост, Австралія</span>.",
      "date": "Квітень 2022",
      "icon": "flight"
    },
    {
      "title": "Nabooki — ...?",
      "location": "Саншайн-Кост",
      "description": "Працювала молодшим розробником в компанії <span style='color:#ff002e'>Nabooki</span> — австралійській компанії, що спеціалізується на системах бронювання та маркетплейс-технологіях. Допомагала команді розробників у покращенні функціоналу платформи, зосереджуючись на оновленнях інтерфейсу (front-end) та незначних завданнях на бекенді. Отримала досвід роботи з <span style='color:#ff002e'>…, та системою контролю версій Git</span> у командному середовищі. Цей короткий, але цінний досвід поглибив моє розуміння реального розробницького процесу та Agile-методологій.",
      "date": "Червень 2022 – Серпень 2022",
      "icon": "work"
    },
    {
      "title": "Бакалавр Інформаційно-комунікаційних технологій",
      "location": "Університет Саншайн-Косту",
      "description": "Вступила на бакалаврат з ICT (інформаційно-комунікаційних технологій) в UniSC. </br>Вивчала різні галузі ІТ, включно з управлінням базами даних, проєктуванням систем, адмініструванням мереж, кібербезпекою, однак основний фокус — це розробка програмного забезпечення. </br></br>Я активно <span style='color:#ff002e'>брала участь у командних проектах</span> та <span style='color:#ff002e'>здобула багато практичного досвіду</span> через завдання, наближені до реальних умов галузі. </br>Також брала участь у соціальному житті університету (волейбол, бадмінтон) і студентських організаціях, таких як Student Guild. </br>Мій середній бал (GPA): <span style='color:#ff002e'>6.5/7</span>",
      "date": "Липень 2022 – Червень 2025",
      "icon": "university"
    },
    {
      "title": "Покоївка в Sea Pearl Mooloolaba та Landmark Resort & Spa",
      "location": "Мулулаба, Саншайн-Кост",
      "description": "Працювала покоївкою в двох відомих курортних готелях: <span style='color:#ff002e'>Sea Pearl Mooloolaba</span> — розкішному готелі на узбережжі, та <span style='color:#ff002e'>Landmark Resort & Spa</span> — популярному та жвавому курорті. Забезпечувала високий рівень прибирання номерів, проявляла ініціативу й професіоналізм, отримувала схвальні відгуки від керівництва. Ця робота допомогла мені розвинути навички <span style='color:#ff002e'>тайм-менеджменту</span>, <span style='color:#ff002e'>організованості</span> та <span style='color:#ff002e'>комунікації</span>, а також залишатися зосередженою й відповідальною в динамічному середовищі.<br/> Я поєднувала цю роботу з навчанням в університеті.",
      "date": "Листопад 2023 - Липень 2025",
      "icon": "housekeeping"
    },
    {
      "title": "Продовжую вчитися",
      "location": "Не має значення, де",
      "description": "Під час навчання в університеті я швидко зрозуміла, що кар'єра розробника — це шлях безперервного навчання. Самого університету недостатньо, щоб набути всі необхідні знання й навички, тому <span style='color:#ff002e'>я приділяю багато часу та зусиль самонавчанню.</span> Я постійно вдосконалюю свої навички програмування, вивчаю нові технології та фреймворки й застосовую ці знання у цікавих проєктах для наповнення портфоліо.",
      "date": "2020 – дотепер",
      "icon": "coding"
    }
  ]
}
